<details><summary>Digger run report at 2023-10-17 23:46:40 (UTC)</summary>
  <details><summary>Plan for <b>thiagonache/potential-goggles#talend</b></summary>
  
```terraform
Terraform will perform the following actions:

  # google_storage_bucket.state will be created
  + resource "google_storage_bucket" "state" {
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = (known after apply)
      + location                    = "US"
      + name                        = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"
      + project                     = (known after apply)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = (known after apply)
      + url                         = (known after apply)

      + versioning {
          + enabled = true
        }
    }

  # module.enable_google_apis.google_project_service.project_services["compute.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "compute.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["container.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "container.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["containerregistry.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "containerregistry.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["datastore.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "datastore.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "iam.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["logging.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "logging.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["monitoring.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "monitoring.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "pubsub.googleapis.com"
    }

  # module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"] will be created
  + resource "google_project_service" "project_services" {
      + disable_dependent_services = true
      + disable_on_destroy         = false
      + id                         = (known after apply)
      + service                    = "storage.googleapis.com"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + state_bucket  = "tnbc-bfc-sbx-ms-kxs-t8gcp-tf-state"
  + test_pr_merge = "test"

─────────────────────────────────────────────────────────────────────────────
  ```
</details>
</details>